02_Cylinder_Subsonic_Turbulent/RANS/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    cylinder
    {
        type            wall;
        nFaces          256;
        startFace       130816;
    }
    periodicity1
    {
        type            empty;
        nFaces          65536;
        startFace       131072;
    }
    periodicity2
    {
        type            empty;
        nFaces          65536;
        startFace       196608;
    }
    wake2
    {
        type            patch;
        nFaces          32;
        startFace       262144;
    }
    inFlow
    {
        type            patch;
        nFaces          192;
        startFace       262176;
    }
    wake1
    {
        type            patch;
        nFaces          32;
        startFace       262368;
    }
)

// ************************************************************************* //
